# Configure where our applications go
cask_args appdir: '/Applications'

# add some casks
tap "candid82/brew"
tap "homebrew/cask-fonts"

# install scripts we want
brew "asdf"
brew "autojump"
brew "awscli"
brew "bpytop"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "exa"
brew "fd"
brew "git"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "md5sha1sum"
brew "pinentry"
brew "pyenv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"

# install the apps we want
#cask "alfred"
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "iterm2"
cask "keepassxc"
cask "spotify"

# install from the App Store
brew "mas"
mas "Xcode", id: 497799835
