# Configure where our applications go
cask_args appdir: '/Applications'

# add some casks
tap "candid82/brew"
tap "caskroom/fonts"

# get brew cask for apps
tap 'caskroom/cask'


# install scripts we want
brew "bash-completion"
brew "bash-git-prompt"
brew "coreutils"
brew "ctags"
brew "fd"
brew "git"
brew "pinentry"
brew "gnupg"
brew "htop"
brew "jq"
brew "macvim", args: ["with-override-system-vim"]
brew "md5sha1sum"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "watch"
brew "wget"
brew "candid82/brew/joker"

# install the apps we want
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "alfred"
cask "keepassxc"

# install from the App Store
brew "mas"
mas "Xcode", id: 497799835
