# Configure where our applications go
cask_args appdir: '/Applications'

# add some casks
tap "candid82/brew"
tap "homebrew/cask-fonts"

# install scripts we want
brew "asdf"
brew "awscli"
brew "bpytop"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "fd"
brew "git"
brew "git-delta"
brew "gnupg"
# brew "htop"
brew "jq"
brew "md5sha1sum"
brew "pinentry"
brew "pyenv"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"

# modern linux
brew "eza"  # ls replace | https://github.com/eza-community/eza
brew "the_silver_searcher"
brew "ripgrep"
brew "lnav" # Log file navigator | https://github.com/tstack/lnav
brew "httpie" # curl replacement | https://github.com/httpie/cli
brew "sd" # sed replacement | https://github.com/chmln/sd
brew "procs" # ps replacement | https://github.com/dalance/procs
brew "lazygit" # git terminal | https://github.com/jesseduffield/lazygit
brew "zoxide" # cd replacement | https://github.com/ajeetdsouza/zoxide
brew "bottom" # htop replacement | https://github.com/ClementTsang/botto
brew "tre-command" # tree replacement | https://github.com/dduan/tre

# install the apps we want
cask "warp"
cask "ghostty"
#cask "alfred"
# cask "homebrew/cask-fonts/font-hack-nerd-font"
# cask "iterm2"
# cask "keepassxc"
# cask "spotify"
# 
# # install from the App Store
# brew "mas"
# mas "Xcode", id: 497799835
